# ExportFontTable Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportFontTable Members
ExportFontTable Class Constructors Methods Properties See Also
---
The ExportFontTable type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExportFontTable | Constructs a new ExportFontTable with default values. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Add | Inserts a (key,info) pair into Export font table. |
| Clear | Removes all contents stored in the table. |
| ContainsKey | Checks whether a font key exists in the table. |
| Dispose | Releases all resources used by the ExportFontTable |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| GetEnumerator | Returns an enumerator that iterates through a collection. |
| GetExportFontInfo | Gets a copy of the font info associated to the input font key. |
| GetFontTableIterator | Returns a FontTableIterator that iterates through the collection. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetKeys | Returns a collection of the keys stored in this table. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetValues | Returns a collection of the values stored in this table. |
| Remove | Removes the pair (key, info) by font key. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Count | Count of the items contained in the collection. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Item | A copy of the ExportFontInfo for the font's ExportFontKey. |

# See Also
ExportFontTable Class
Autodesk.Revit.DB Namespace